Revit 2024 API
PipeSettings.FlatOnBottom Property
 The abbreviation of the Flat On Bottom (FOB) string.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public string FlatOnBottom { get; set; }
Visual Basic
Public Property FlatOnBottom As String
	Get
	Set
Visual C++
public:
property String^ FlatOnBottom {
	String^ get ();
	void set (String^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
PipeSettings Class
Autodesk.Revit.DB.Plumbing Namespace